{
  "courses": [
    {
      "code": "CSE110",
      "title": "Programming Language I",
      "level": "Undergraduate",
      "semester": "Fall 2025",
      "students": null,
      "rating": null,
      "description": "An introduction to the foundations of computation and the purpose of mechanized computation. Emphasis is placed on techniques of problem analysis and the development of algorithms and programs. Topics include algorithms, flow chart construction, information representation, and writing, debugging, and running programs."
    },
    {
      "code": "CSE111",
      "title": "Object Oriented Programming",
      "level": "Undergraduate",
      "semester": "Fall 2025",
      "students": null,
      "rating": null,
      "description": "This course is an introduction to data structures, formal specification of syntax, elements of language theory and mathematical preliminaries. Topics include formal languages, structured programming concepts, and a survey of features of existing high level languages. Students design and write applications using an appropriate language, with a compulsory 3-hour weekly lab."
    },
    {
      "code": "CSE220",
      "title": "Data Structures",
      "level": "Undergraduate",
      "semester": "Lab",
      "students": null,
      "rating": null,
      "description": "This course is an introduction to data structures, where students study elementary data structures such as arrays, lists, stacks, queues, trees, etc. These data structures are used to study and implement different algorithms such as sorting, searching, tree traversal, etc. The course includes a 3-hour mandatory laboratory per week where students use Java to implement the various data structures and algorithms learned in the theory component."
    },
    {
      "code": "CSE260",
      "title": "Digital Logic Design",
      "level": "Undergraduate",
      "semester": "Lab",
      "students": null,
      "rating": null,
      "description": "This course provides an introduction to digital systems such as computer, communication and information systems. The course covers Boolean algebra, digital logic gates, combinational logic circuits, decoders, encoders, multiplexers and demultiplexers, as well as sequential circuits: asynchronous and synchronous counters, registers, flip-flops. An introduction to memory elements and registers is also provided. The course includes a compulsory 3-hour laboratory work each week."
    }
  ],
  "teachingPhilosophy": {
    "title": "My Teaching Philosophy",
    "content": "I believe that a teacher's job is to be calm and explain the same concept a hundred times if needed, without getting annoyed. My full lecture series is available on the university's buX platform and my YouTube channel, 'Learn with Tawhid', to ensure students have access to the resources they need to succeed."
  },
  "contentCreation": {
    "description": "Built four complete programming courses available to students: two in Python (Structured Programming & OOP) and two in Java (Structured Programming & OOP).",
    "videoSeries": [
      {
        "title": "Python Structured Programming series",
        "count": "30+"
      },
      {
        "title": "Python OOP series",
        "count": "45+"
      },
      {
        "title": "Java Structured Programming series",
        "count": "35+"
      },
      {
        "title": "Java OOP series",
        "count": "40+"
      }
    ],
    "impact": "~7,000+ BRACU students benefited during/after COVID; continuing global reach via the Learn with Tawhid channel."
  },
  "curriculumTransition": [
    {
      "year": "2020",
      "transition": "Java → Python",
      "description": "Led the Java → Python shift (rebuilt course structures, labs, assessments)."
    },
    {
      "year": "2024",
      "transition": "Python → Java",
      "description": "Led the reversion to Java — rebuilding materials from scratch and publishing full Java lecture series to buX/YouTube."
    }
  ],
  "achievements": [
    {
      "title": "Chancellor’s Gold Medal (Valedictorian, M.Sc.)",
      "year": "2023",
      "organization": "BRAC University",
      "description": "unavailable"
    },
    {
      "title": "Best Teaching Award",
      "year": "2022",
      "organization": "BRAC University",
      "description": "unavailable"
    },
    {
      "title": "Outstanding Service Award",
      "year": "2025",
      "organization": "Department of CSE, BRAC University",
      "description": "unavailable"
    }
  ]
}